Revit 2027 API
EnergyAnalysisOpening.GetPolyloops Method
 Gets the collection of planar polygons describing the opening geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Polyloop> GetPolyloops()
Public Function GetPolyloops As IList(Of Polyloop)
public:
IList<Polyloop^>^ GetPolyloops()
member GetPolyloops : unit -> IList<Polyloop>
Return Value
IList<Polyloop>
 The collection of polygons describing the opening geometry.
Remarks
 A collection of polyloops (planar polygons) describing the opening geometry as described in gbXML. The geometry is currently measured per analytical(center-line).
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace